app/controllers/main_controller.rb

    def create
         @user = User.new(user_params)
         if @user.save
---
INSERT INTO "users" ("email", "user_type", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["email", "William@gmail.comS"], ["user_type", nil], ["password_digest", "[FILTERED]"], ["created_at", "2022-03-11 17:24:05.304870"], ["updated_at", "2022-03-11 17:24:05.304870"]]

    def update
        email = params[:user][:email]
        user_type = params[:user][:user_type]
        user = User.find_by(email: email)
        user.user_type = user_type
        user.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'william@gmail.com' LIMIT 1
UPDATE `users` SET `users`.`user_type` = 'staff', `users`.`updated_at` = '2022-03-14 13:35:36.254750' WHERE `users`.`id` = 1

    def delete
        email = params[:user][:email]
        User.destroy_by(email: email)
---
DELETE FROM `users` WHERE `users`.`id` = 2